//Task 1
// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().


// const number = Number(prompt("Введіть число"));
// if (number === 10) {
//     alert("Вірно")
// } else {
//     alert("Невірно")
// }

//Task  2

// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * 59);
// if (min <= 15) {
//     alert(`${min} входить у першу чверть`);
// } else if (min <= 30) {
//     alert(`${min} входить у другу чверть`);
// } else if (min <= 45) {
//     alert(`${min} входить у третю чверть`);
// } else {
//     alert(`${min} входить у четверту чверть`);
// }

//Task 3

// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.

// const num = Number(prompt("Введіть число від 1 до 4"));
// let result = "";
// switch (num) {
//     case 1:
//         result = "winter";
//         break;
//     case 2:
//         result = "spring";
//         break;
//     case 3:
//         result = "summer";
//         break;
//     case 4:
//         result = "outumn";
//         break;
//     default:
//         alert( "Вибачте, але ви маєте ввести значення від 1 до 4 включно");
// }

// console.log(result);


//Task 4
// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'):
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples


// const minutes = prompt("Введіть число");
// const hours = Math.floor(minutes / 60);
// const modifiedHours = String(hours).padStart(2, 0);
// const min = minutes % 60;
// const modifiedMinutes = String(min).padStart(2, 0);

// const time = `${modifiedHours}:${modifiedMinutes}`;
// console.log(time);


// Task 5

// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера
// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).

// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"

// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:

// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",

// в іншому випадку вивести в alert рядок "Невірний пароль!"


//  const login = prompt("Введіть свій логін");
//  console.log(login);

// if (login === "Адмін") {
//   const password = prompt("Введіть свій пароль");
//   if (password === "Я головний") {
//     alert("Добрий день!");
//   } else {
//     alert("Невірний пароль!");
//   }
// } else if (login === null || login === "") {
//   alert("Скасовано");
// } else {
//   alert("Я вас не знаю");
// }


//Task 6
// Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.

// let counter = 0;
// while (counter <= 20) {
//     console.log(counter)
//     counter+=2;
// }


// Task 7
// Напишіть функцію getNumbers(min, max), що приймає 2 параметри -
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.

// function getNumbers(min, max) {
//     let sum = 0;
//     for (let i = max; i >= min; i--) {
//         console.log(i);
//         if (i % 2 === 0) {
//             sum += i;
//         }
//     }
//     return sum;
// }
// console.log(getNumbers(10,47))